:: ！！！此脚本回关闭你的计算机！！！
@echo off

:: -------------------------------------------
:: 命令
:: -------------------------------------------

:: shutdown

:: -------------------------------------------
:: 参数
:: -------------------------------------------

:: 关键参数

:: /l 注销

:: /s 关机

:: /r 重启

:: /h 休眠

:: /a 取消计划的关机（仅在延时范围内生效）

:: 辅助参数

:: /f 强制关机

:: /p 立即关闭（默认都有延时）

:: /t 指定秒后关机

:: -------------------------------------------
:: 实例
:: -------------------------------------------

:: 60秒后关机
shutdown /s /t 300

:: 立刻关机
:: shutdown /s /p
:: shutdown /s /t 0

:: 立刻强制关机
:: shutdown /s /p /f

:: 取消关机（仅在有超时（设置了t参数）情况下）
shutdown /a

pause